MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M0518SD2AE/mcu.h
#define BPWM_INTEN_CMPDIEN4_Pos          (28)                                               /*!< BPWM_T::INTEN: CMPDIEN4 Position           */
#define BPWM_INTEN_CMPDIEN4_Msk          (0x1ul << BPWM_INTEN_CMPDIEN4_Pos)                 /*!< BPWM_T::INTEN: CMPDIEN4 Mask               */

#define BPWM_INTEN_CMPDIEN5_Pos          (29)                                               /*!< BPWM_T::INTEN: CMPDIEN5 Position           */
#define BPWM_INTEN_CMPDIEN5_Msk          (0x1ul << BPWM_INTEN_CMPDIEN5_Pos)                 /*!< BPWM_T::INTEN: CMPDIEN5 Mask               */

#define BPWM_INTSTS_ZIF0_Pos             (0)                                                /*!< BPWM_T::INTSTS: ZIF0 Position              */
#define BPWM_INTSTS_ZIF0_Msk             (0x1ul << BPWM_INTSTS_ZIF0_Pos)                    /*!< BPWM_T::INTSTS: ZIF0 Mask                  */

#define BPWM_INTSTS_PIF0_Pos             (8)                                                /*!< BPWM_T::INTSTS: PIF0 Position              */
#define BPWM_INTSTS_PIF0_Msk             (0x1ul << BPWM_INTSTS_PIF0_Pos)                    /*!< BPWM_T::INTSTS: PIF0 Mask                  */

#define BPWM_INTSTS_CMPUIFn_Pos          (16)                                               /*!< BPWM_T::INTSTS: CMPUIFn Position           */
#define BPWM_INTSTS_CMPUIFn_Msk          (0x3ful << BPWM_INTSTS_CMPUIFn_Pos)                /*!< BPWM_T::INTSTS: CMPUIFn Mask               */

#define BPWM_INTSTS_CMPUIF0_Pos          (16)                                               /*!< BPWM_T::INTSTS: CMPUIF0 Position           */
#define BPWM_INTSTS_CMPUIF0_Msk          (0x1ul << BPWM_INTSTS_CMPUIF0_Pos)                 /*!< BPWM_T::INTSTS: CMPUIF0 Mask               */

#define BPWM_INTSTS_CMPUIF1_Pos          (17)                                               /*!< BPWM_T::INTSTS: CMPUIF1 Position           */
#define BPWM_INTSTS_CMPUIF1_Msk          (0x1ul << BPWM_INTSTS_CMPUIF1_Pos)                 /*!< BPWM_T::INTSTS: CMPUIF1 Mask               */

#define BPWM_INTSTS_CMPUIF2_Pos          (18)                                               /*!< BPWM_T::INTSTS: CMPUIF2 Position           */
#define BPWM_INTSTS_CMPUIF2_Msk          (0x1ul << BPWM_INTSTS_CMPUIF2_Pos)                 /*!< BPWM_T::INTSTS: CMPUIF2 Mask               */

#define BPWM_INTSTS_CMPUIF3_Pos          (19)                                               /*!< BPWM_T::INTSTS: CMPUIF3 Position           */
#define BPWM_INTSTS_CMPUIF3_Msk          (0x1ul << BPWM_INTSTS_CMPUIF3_Pos)                 /*!< BPWM_T::INTSTS: CMPUIF3 Mask               */

#define BPWM_INTSTS_CMPUIF4_Pos          (20)                                               /*!< BPWM_T::INTSTS: CMPUIF4 Position           */
#define BPWM_INTSTS_CMPUIF4_Msk          (0x1ul << BPWM_INTSTS_CMPUIF4_Pos)                 /*!< BPWM_T::INTSTS: CMPUIF4 Mask               */

#define BPWM_INTSTS_CMPUIF5_Pos          (21)                                               /*!< BPWM_T::INTSTS: CMPUIF5 Position           */
#define BPWM_INTSTS_CMPUIF5_Msk          (0x1ul << BPWM_INTSTS_CMPUIF5_Pos)                 /*!< BPWM_T::INTSTS: CMPUIF5 Mask               */

#define BPWM_INTSTS_CMPDIFn_Pos          (24)                                               /*!< BPWM_T::INTSTS: CMPDIFn Position           */
#define BPWM_INTSTS_CMPDIFn_Msk          (0x3ful << BPWM_INTSTS_CMPDIFn_Pos)                /*!< BPWM_T::INTSTS: CMPDIFn Mask               */

#define BPWM_INTSTS_CMPDIF0_Pos          (24)                                               /*!< BPWM_T::INTSTS: CMPDIF0 Position           */
#define BPWM_INTSTS_CMPDIF0_Msk          (0x1ul << BPWM_INTSTS_CMPDIF0_Pos)                 /*!< BPWM_T::INTSTS: CMPDIF0 Mask               */

#define BPWM_INTSTS_CMPDIF1_Pos          (25)                                               /*!< BPWM_T::INTSTS: CMPDIF1 Position           */
#define BPWM_INTSTS_CMPDIF1_Msk          (0x1ul << BPWM_INTSTS_CMPDIF1_Pos)                 /*!< BPWM_T::INTSTS: CMPDIF1 Mask               */

#define BPWM_INTSTS_CMPDIF2_Pos          (26)                                               /*!< BPWM_T::INTSTS: CMPDIF2 Position           */
#define BPWM_INTSTS_CMPDIF2_Msk          (0x1ul << BPWM_INTSTS_CMPDIF2_Pos)                 /*!< BPWM_T::INTSTS: CMPDIF2 Mask               */

#define BPWM_INTSTS_CMPDIF3_Pos          (27)                                               /*!< BPWM_T::INTSTS: CMPDIF3 Position           */
#define BPWM_INTSTS_CMPDIF3_Msk          (0x1ul << BPWM_INTSTS_CMPDIF3_Pos)                 /*!< BPWM_T::INTSTS: CMPDIF3 Mask               */

#define BPWM_INTSTS_CMPDIF4_Pos          (28)                                               /*!< BPWM_T::INTSTS: CMPDIF4 Position           */
#define BPWM_INTSTS_CMPDIF4_Msk          (0x1ul << BPWM_INTSTS_CMPDIF4_Pos)                 /*!< BPWM_T::INTSTS: CMPDIF4 Mask               */

#define BPWM_INTSTS_CMPDIF5_Pos          (29)                                               /*!< BPWM_T::INTSTS: CMPDIF5 Position           */
#define BPWM_INTSTS_CMPDIF5_Msk          (0x1ul << BPWM_INTSTS_CMPDIF5_Pos)                 /*!< BPWM_T::INTSTS: CMPDIF5 Mask               */

#define BPWM_ADCTS0_TRGSEL0_Pos          (0)                                                /*!< BPWM_T::ADCTS0: TRGSEL0 Position           */
#define BPWM_ADCTS0_TRGSEL0_Msk          (0xful << BPWM_ADCTS0_TRGSEL0_Pos)                 /*!< BPWM_T::ADCTS0: TRGSEL0 Mask               */

#define BPWM_ADCTS0_TRGEN0_Pos           (7)                                                /*!< BPWM_T::ADCTS0: TRGEN0 Position            */
#define BPWM_ADCTS0_TRGEN0_Msk           (0x1ul << BPWM_ADCTS0_TRGEN0_Pos)                  /*!< BPWM_T::ADCTS0: TRGEN0 Mask                */

#define BPWM_ADCTS0_TRGSEL1_Pos          (8)                                                /*!< BPWM_T::ADCTS0: TRGSEL1 Position           */
#define BPWM_ADCTS0_TRGSEL1_Msk          (0xful << BPWM_ADCTS0_TRGSEL1_Pos)                 /*!< BPWM_T::ADCTS0: TRGSEL1 Mask               */

