MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M0518SD2AE/mcu.h
#define BPWM_ADCTS0_TRGEN1_Pos           (15)                                               /*!< BPWM_T::ADCTS0: TRGEN1 Position            */
#define BPWM_ADCTS0_TRGEN1_Msk           (0x1ul << BPWM_ADCTS0_TRGEN1_Pos)                  /*!< BPWM_T::ADCTS0: TRGEN1 Mask                */

#define BPWM_ADCTS0_TRGSEL2_Pos          (16)                                               /*!< BPWM_T::ADCTS0: TRGSEL2 Position           */
#define BPWM_ADCTS0_TRGSEL2_Msk          (0xful << BPWM_ADCTS0_TRGSEL2_Pos)                 /*!< BPWM_T::ADCTS0: TRGSEL2 Mask               */

#define BPWM_ADCTS0_TRGEN2_Pos           (23)                                               /*!< BPWM_T::ADCTS0: TRGEN2 Position            */
#define BPWM_ADCTS0_TRGEN2_Msk           (0x1ul << BPWM_ADCTS0_TRGEN2_Pos)                  /*!< BPWM_T::ADCTS0: TRGEN2 Mask                */

#define BPWM_ADCTS0_TRGSEL3_Pos          (24)                                               /*!< BPWM_T::ADCTS0: TRGSEL3 Position           */
#define BPWM_ADCTS0_TRGSEL3_Msk          (0xful << BPWM_ADCTS0_TRGSEL3_Pos)                 /*!< BPWM_T::ADCTS0: TRGSEL3 Mask               */

#define BPWM_ADCTS0_TRGEN3_Pos           (31)                                               /*!< BPWM_T::ADCTS0: TRGEN3 Position            */
#define BPWM_ADCTS0_TRGEN3_Msk           (0x1ul << BPWM_ADCTS0_TRGEN3_Pos)                  /*!< BPWM_T::ADCTS0: TRGEN3 Mask                */

#define BPWM_ADCTS1_TRGSEL4_Pos          (0)                                                /*!< BPWM_T::ADCTS1: TRGSEL4 Position           */
#define BPWM_ADCTS1_TRGSEL4_Msk          (0xful << BPWM_ADCTS1_TRGSEL4_Pos)                 /*!< BPWM_T::ADCTS1: TRGSEL4 Mask               */

#define BPWM_ADCTS1_TRGEN4_Pos           (7)                                                /*!< BPWM_T::ADCTS1: TRGEN4 Position            */
#define BPWM_ADCTS1_TRGEN4_Msk           (0x1ul << BPWM_ADCTS1_TRGEN4_Pos)                  /*!< BPWM_T::ADCTS1: TRGEN4 Mask                */

#define BPWM_ADCTS1_TRGSEL5_Pos          (8)                                                /*!< BPWM_T::ADCTS1: TRGSEL5 Position           */
#define BPWM_ADCTS1_TRGSEL5_Msk          (0xful << BPWM_ADCTS1_TRGSEL5_Pos)                 /*!< BPWM_T::ADCTS1: TRGSEL5 Mask               */

#define BPWM_ADCTS1_TRGEN5_Pos           (15)                                               /*!< BPWM_T::ADCTS1: TRGEN5 Position            */
#define BPWM_ADCTS1_TRGEN5_Msk           (0x1ul << BPWM_ADCTS1_TRGEN5_Pos)                  /*!< BPWM_T::ADCTS1: TRGEN5 Mask                */

#define BPWM_SSCTL_SSEN0_Pos             (0)                                                /*!< BPWM_T::SSCTL: SSEN0 Position              */
#define BPWM_SSCTL_SSEN0_Msk             (0x1ul << BPWM_SSCTL_SSEN0_Pos)                    /*!< BPWM_T::SSCTL: SSEN0 Mask                  */

#define BPWM_SSCTL_SSRC_Pos              (8)                                                /*!< BPWM_T::SSCTL: SSRC Position               */
#define BPWM_SSCTL_SSRC_Msk              (0x3ul << BPWM_SSCTL_SSRC_Pos)                     /*!< BPWM_T::SSCTL: SSRC Mask                   */

#define BPWM_SSTRG_CNTSEN_Pos            (0)                                                /*!< BPWM_T::SSTRG: CNTSEN Position             */
#define BPWM_SSTRG_CNTSEN_Msk            (0x1ul << BPWM_SSTRG_CNTSEN_Pos)                   /*!< BPWM_T::SSTRG: CNTSEN Mask                 */

#define BPWM_STATUS_CNTMAXF0_Pos         (0)                                                /*!< BPWM_T::STATUS: CNTMAXF0 Position          */
#define BPWM_STATUS_CNTMAXF0_Msk         (0x1ul << BPWM_STATUS_CNTMAXF0_Pos)                /*!< BPWM_T::STATUS: CNTMAXF0 Mask              */

#define BPWM_STATUS_ADCTRGFn_Pos         (16)                                               /*!< BPWM_T::STATUS: ADCTRGFn Position          */
#define BPWM_STATUS_ADCTRGFn_Msk         (0x3ful << BPWM_STATUS_ADCTRGFn_Pos)               /*!< BPWM_T::STATUS: ADCTRGFn Mask              */

#define BPWM_STATUS_ADCTRGF0_Pos         (16)                                               /*!< BPWM_T::STATUS: ADCTRGF0 Position          */
#define BPWM_STATUS_ADCTRGF0_Msk         (0x1ul << BPWM_STATUS_ADCTRGF0_Pos)                /*!< BPWM_T::STATUS: ADCTRGF0 Mask              */

#define BPWM_STATUS_ADCTRGF1_Pos         (17)                                               /*!< BPWM_T::STATUS: ADCTRGF1 Position          */
#define BPWM_STATUS_ADCTRGF1_Msk         (0x1ul << BPWM_STATUS_ADCTRGF1_Pos)                /*!< BPWM_T::STATUS: ADCTRGF1 Mask              */

#define BPWM_STATUS_ADCTRGF2_Pos         (18)                                               /*!< BPWM_T::STATUS: ADCTRGF2 Position          */
#define BPWM_STATUS_ADCTRGF2_Msk         (0x1ul << BPWM_STATUS_ADCTRGF2_Pos)                /*!< BPWM_T::STATUS: ADCTRGF2 Mask              */

#define BPWM_STATUS_ADCTRGF3_Pos         (19)                                               /*!< BPWM_T::STATUS: ADCTRGF3 Position          */
#define BPWM_STATUS_ADCTRGF3_Msk         (0x1ul << BPWM_STATUS_ADCTRGF3_Pos)                /*!< BPWM_T::STATUS: ADCTRGF3 Mask              */

#define BPWM_STATUS_ADCTRGF4_Pos         (20)                                               /*!< BPWM_T::STATUS: ADCTRGF4 Position          */
#define BPWM_STATUS_ADCTRGF4_Msk         (0x1ul << BPWM_STATUS_ADCTRGF4_Pos)                /*!< BPWM_T::STATUS: ADCTRGF4 Mask              */

#define BPWM_STATUS_ADCTRGF5_Pos         (21)                                               /*!< BPWM_T::STATUS: ADCTRGF5 Position          */
#define BPWM_STATUS_ADCTRGF5_Msk         (0x1ul << BPWM_STATUS_ADCTRGF5_Pos)                /*!< BPWM_T::STATUS: ADCTRGF5 Mask              */

#define BPWM_CAPINEN_CAPINENn_Pos        (0)                                                /*!< BPWM_T::CAPINEN: CAPINENn Position         */
#define BPWM_CAPINEN_CAPINENn_Msk        (0x3ful << BPWM_CAPINEN_CAPINENn_Pos)              /*!< BPWM_T::CAPINEN: CAPINENn Mask             */

