MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M0518SD2AE/mcu.h
#define BPWM_CAPINEN_CAPINEN0_Pos        (0)                                                /*!< BPWM_T::CAPINEN: CAPINEN0 Position         */
#define BPWM_CAPINEN_CAPINEN0_Msk        (0x1ul << BPWM_CAPINEN_CAPINEN0_Pos)               /*!< BPWM_T::CAPINEN: CAPINEN0 Mask             */

#define BPWM_CAPINEN_CAPINEN1_Pos        (1)                                                /*!< BPWM_T::CAPINEN: CAPINEN1 Position         */
#define BPWM_CAPINEN_CAPINEN1_Msk        (0x1ul << BPWM_CAPINEN_CAPINEN1_Pos)               /*!< BPWM_T::CAPINEN: CAPINEN1 Mask             */

#define BPWM_CAPINEN_CAPINEN2_Pos        (2)                                                /*!< BPWM_T::CAPINEN: CAPINEN2 Position         */
#define BPWM_CAPINEN_CAPINEN2_Msk        (0x1ul << BPWM_CAPINEN_CAPINEN2_Pos)               /*!< BPWM_T::CAPINEN: CAPINEN2 Mask             */

#define BPWM_CAPINEN_CAPINEN3_Pos        (3)                                                /*!< BPWM_T::CAPINEN: CAPINEN3 Position         */
#define BPWM_CAPINEN_CAPINEN3_Msk        (0x1ul << BPWM_CAPINEN_CAPINEN3_Pos)               /*!< BPWM_T::CAPINEN: CAPINEN3 Mask             */

#define BPWM_CAPINEN_CAPINEN4_Pos        (4)                                                /*!< BPWM_T::CAPINEN: CAPINEN4 Position         */
#define BPWM_CAPINEN_CAPINEN4_Msk        (0x1ul << BPWM_CAPINEN_CAPINEN4_Pos)               /*!< BPWM_T::CAPINEN: CAPINEN4 Mask             */

#define BPWM_CAPINEN_CAPINEN5_Pos        (5)                                                /*!< BPWM_T::CAPINEN: CAPINEN5 Position         */
#define BPWM_CAPINEN_CAPINEN5_Msk        (0x1ul << BPWM_CAPINEN_CAPINEN5_Pos)               /*!< BPWM_T::CAPINEN: CAPINEN5 Mask             */

#define BPWM_CAPCTL_CAPENn_Pos           (0)                                                /*!< BPWM_T::CAPCTL: CAPENn Position            */
#define BPWM_CAPCTL_CAPENn_Msk           (0x3ful << BPWM_CAPCTL_CAPENn_Pos)                 /*!< BPWM_T::CAPCTL: CAPENn Mask                */

#define BPWM_CAPCTL_CAPEN0_Pos           (0)                                                /*!< BPWM_T::CAPCTL: CAPEN0 Position            */
#define BPWM_CAPCTL_CAPEN0_Msk           (0x1ul << BPWM_CAPCTL_CAPEN0_Pos)                  /*!< BPWM_T::CAPCTL: CAPEN0 Mask                */

#define BPWM_CAPCTL_CAPEN1_Pos           (1)                                                /*!< BPWM_T::CAPCTL: CAPEN1 Position            */
#define BPWM_CAPCTL_CAPEN1_Msk           (0x1ul << BPWM_CAPCTL_CAPEN1_Pos)                  /*!< BPWM_T::CAPCTL: CAPEN1 Mask                */

#define BPWM_CAPCTL_CAPEN2_Pos           (2)                                                /*!< BPWM_T::CAPCTL: CAPEN2 Position            */
#define BPWM_CAPCTL_CAPEN2_Msk           (0x1ul << BPWM_CAPCTL_CAPEN2_Pos)                  /*!< BPWM_T::CAPCTL: CAPEN2 Mask                */

#define BPWM_CAPCTL_CAPEN3_Pos           (3)                                                /*!< BPWM_T::CAPCTL: CAPEN3 Position            */
#define BPWM_CAPCTL_CAPEN3_Msk           (0x1ul << BPWM_CAPCTL_CAPEN3_Pos)                  /*!< BPWM_T::CAPCTL: CAPEN3 Mask                */

#define BPWM_CAPCTL_CAPEN4_Pos           (4)                                                /*!< BPWM_T::CAPCTL: CAPEN4 Position            */
#define BPWM_CAPCTL_CAPEN4_Msk           (0x1ul << BPWM_CAPCTL_CAPEN4_Pos)                  /*!< BPWM_T::CAPCTL: CAPEN4 Mask                */

#define BPWM_CAPCTL_CAPEN5_Pos           (5)                                                /*!< BPWM_T::CAPCTL: CAPEN5 Position            */
#define BPWM_CAPCTL_CAPEN5_Msk           (0x1ul << BPWM_CAPCTL_CAPEN5_Pos)                  /*!< BPWM_T::CAPCTL: CAPEN5 Mask                */

#define BPWM_CAPCTL_CAPINVn_Pos          (8)                                                /*!< BPWM_T::CAPCTL: CAPINVn Position           */
#define BPWM_CAPCTL_CAPINVn_Msk          (0x3ful << BPWM_CAPCTL_CAPINVn_Pos)                /*!< BPWM_T::CAPCTL: CAPINVn Mask               */

#define BPWM_CAPCTL_CAPINV0_Pos          (8)                                                /*!< BPWM_T::CAPCTL: CAPINV0 Position           */
#define BPWM_CAPCTL_CAPINV0_Msk          (0x1ul << BPWM_CAPCTL_CAPINV0_Pos)                 /*!< BPWM_T::CAPCTL: CAPINV0 Mask               */

#define BPWM_CAPCTL_CAPINV1_Pos          (9)                                                /*!< BPWM_T::CAPCTL: CAPINV1 Position           */
#define BPWM_CAPCTL_CAPINV1_Msk          (0x1ul << BPWM_CAPCTL_CAPINV1_Pos)                 /*!< BPWM_T::CAPCTL: CAPINV1 Mask               */

#define BPWM_CAPCTL_CAPINV2_Pos          (10)                                               /*!< BPWM_T::CAPCTL: CAPINV2 Position           */
#define BPWM_CAPCTL_CAPINV2_Msk          (0x1ul << BPWM_CAPCTL_CAPINV2_Pos)                 /*!< BPWM_T::CAPCTL: CAPINV2 Mask               */

#define BPWM_CAPCTL_CAPINV3_Pos          (11)                                               /*!< BPWM_T::CAPCTL: CAPINV3 Position           */
#define BPWM_CAPCTL_CAPINV3_Msk          (0x1ul << BPWM_CAPCTL_CAPINV3_Pos)                 /*!< BPWM_T::CAPCTL: CAPINV3 Mask               */

#define BPWM_CAPCTL_CAPINV4_Pos          (12)                                               /*!< BPWM_T::CAPCTL: CAPINV4 Position           */
#define BPWM_CAPCTL_CAPINV4_Msk          (0x1ul << BPWM_CAPCTL_CAPINV4_Pos)                 /*!< BPWM_T::CAPCTL: CAPINV4 Mask               */

#define BPWM_CAPCTL_CAPINV5_Pos          (13)                                               /*!< BPWM_T::CAPCTL: CAPINV5 Position           */
#define BPWM_CAPCTL_CAPINV5_Msk          (0x1ul << BPWM_CAPCTL_CAPINV5_Pos)                 /*!< BPWM_T::CAPCTL: CAPINV5 Mask               */

#define BPWM_CAPCTL_RCRLDENn_Pos         (16)                                               /*!< BPWM_T::CAPCTL: RCRLDENn Position          */
#define BPWM_CAPCTL_RCRLDENn_Msk         (0x3ful << BPWM_CAPCTL_RCRLDENn_Pos)               /*!< BPWM_T::CAPCTL: RCRLDENn Mask              */

#define BPWM_CAPCTL_RCRLDEN0_Pos         (16)                                               /*!< BPWM_T::CAPCTL: RCRLDEN0 Position          */
#define BPWM_CAPCTL_RCRLDEN0_Msk         (0x1ul << BPWM_CAPCTL_RCRLDEN0_Pos)                /*!< BPWM_T::CAPCTL: RCRLDEN0 Mask              */

#define BPWM_CAPCTL_RCRLDEN1_Pos         (17)                                               /*!< BPWM_T::CAPCTL: RCRLDEN1 Position          */
#define BPWM_CAPCTL_RCRLDEN1_Msk         (0x1ul << BPWM_CAPCTL_RCRLDEN1_Pos)                /*!< BPWM_T::CAPCTL: RCRLDEN1 Mask              */

#define BPWM_CAPCTL_RCRLDEN2_Pos         (18)                                               /*!< BPWM_T::CAPCTL: RCRLDEN2 Position          */
#define BPWM_CAPCTL_RCRLDEN2_Msk         (0x1ul << BPWM_CAPCTL_RCRLDEN2_Pos)                /*!< BPWM_T::CAPCTL: RCRLDEN2 Mask              */

