MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M0518SD2AE/mcu.h
#define BPWM_CAPCTL_RCRLDEN3_Pos         (19)                                               /*!< BPWM_T::CAPCTL: RCRLDEN3 Position          */
#define BPWM_CAPCTL_RCRLDEN3_Msk         (0x1ul << BPWM_CAPCTL_RCRLDEN3_Pos)                /*!< BPWM_T::CAPCTL: RCRLDEN3 Mask              */

#define BPWM_CAPCTL_RCRLDEN4_Pos         (20)                                               /*!< BPWM_T::CAPCTL: RCRLDEN4 Position          */
#define BPWM_CAPCTL_RCRLDEN4_Msk         (0x1ul << BPWM_CAPCTL_RCRLDEN4_Pos)                /*!< BPWM_T::CAPCTL: RCRLDEN4 Mask              */

#define BPWM_CAPCTL_RCRLDEN5_Pos         (21)                                               /*!< BPWM_T::CAPCTL: RCRLDEN5 Position          */
#define BPWM_CAPCTL_RCRLDEN5_Msk         (0x1ul << BPWM_CAPCTL_RCRLDEN5_Pos)                /*!< BPWM_T::CAPCTL: RCRLDEN5 Mask              */

#define BPWM_CAPCTL_FCRLDENn_Pos         (24)                                               /*!< BPWM_T::CAPCTL: FCRLDENn Position          */
#define BPWM_CAPCTL_FCRLDENn_Msk         (0x3ful << BPWM_CAPCTL_FCRLDENn_Pos)               /*!< BPWM_T::CAPCTL: FCRLDENn Mask              */

#define BPWM_CAPCTL_FCRLDEN0_Pos         (24)                                               /*!< BPWM_T::CAPCTL: FCRLDEN0 Position          */
#define BPWM_CAPCTL_FCRLDEN0_Msk         (0x1ul << BPWM_CAPCTL_FCRLDEN0_Pos)                /*!< BPWM_T::CAPCTL: FCRLDEN0 Mask              */

#define BPWM_CAPCTL_FCRLDEN1_Pos         (25)                                               /*!< BPWM_T::CAPCTL: FCRLDEN1 Position          */
#define BPWM_CAPCTL_FCRLDEN1_Msk         (0x1ul << BPWM_CAPCTL_FCRLDEN1_Pos)                /*!< BPWM_T::CAPCTL: FCRLDEN1 Mask              */

#define BPWM_CAPCTL_FCRLDEN2_Pos         (26)                                               /*!< BPWM_T::CAPCTL: FCRLDEN2 Position          */
#define BPWM_CAPCTL_FCRLDEN2_Msk         (0x1ul << BPWM_CAPCTL_FCRLDEN2_Pos)                /*!< BPWM_T::CAPCTL: FCRLDEN2 Mask              */

#define BPWM_CAPCTL_FCRLDEN3_Pos         (27)                                               /*!< BPWM_T::CAPCTL: FCRLDEN3 Position          */
#define BPWM_CAPCTL_FCRLDEN3_Msk         (0x1ul << BPWM_CAPCTL_FCRLDEN3_Pos)                /*!< BPWM_T::CAPCTL: FCRLDEN3 Mask              */

#define BPWM_CAPCTL_FCRLDEN4_Pos         (28)                                               /*!< BPWM_T::CAPCTL: FCRLDEN4 Position          */
#define BPWM_CAPCTL_FCRLDEN4_Msk         (0x1ul << BPWM_CAPCTL_FCRLDEN4_Pos)                /*!< BPWM_T::CAPCTL: FCRLDEN4 Mask              */

#define BPWM_CAPCTL_FCRLDEN5_Pos         (29)                                               /*!< BPWM_T::CAPCTL: FCRLDEN5 Position          */
#define BPWM_CAPCTL_FCRLDEN5_Msk         (0x1ul << BPWM_CAPCTL_FCRLDEN5_Pos)                /*!< BPWM_T::CAPCTL: FCRLDEN5 Mask              */

#define BPWM_CAPSTS_CRLIFOVn_Pos         (0)                                                /*!< BPWM_T::CAPSTS: CRLIFOVn Position          */
#define BPWM_CAPSTS_CRLIFOVn_Msk         (0x3ful << BPWM_CAPSTS_CRLIFOVn_Pos)               /*!< BPWM_T::CAPSTS: CRLIFOVn Mask              */

#define BPWM_CAPSTS_CRLIFOV0_Pos         (0)                                                /*!< BPWM_T::CAPSTS: CRLIFOV0 Position          */
#define BPWM_CAPSTS_CRLIFOV0_Msk         (0x1ul << BPWM_CAPSTS_CRLIFOV0_Pos)                /*!< BPWM_T::CAPSTS: CRLIFOV0 Mask              */

#define BPWM_CAPSTS_CRLIFOV1_Pos         (1)                                                /*!< BPWM_T::CAPSTS: CRLIFOV1 Position          */
#define BPWM_CAPSTS_CRLIFOV1_Msk         (0x1ul << BPWM_CAPSTS_CRLIFOV1_Pos)                /*!< BPWM_T::CAPSTS: CRLIFOV1 Mask              */

#define BPWM_CAPSTS_CRLIFOV2_Pos         (2)                                                /*!< BPWM_T::CAPSTS: CRLIFOV2 Position          */
#define BPWM_CAPSTS_CRLIFOV2_Msk         (0x1ul << BPWM_CAPSTS_CRLIFOV2_Pos)                /*!< BPWM_T::CAPSTS: CRLIFOV2 Mask              */

#define BPWM_CAPSTS_CRLIFOV3_Pos         (3)                                                /*!< BPWM_T::CAPSTS: CRLIFOV3 Position          */
#define BPWM_CAPSTS_CRLIFOV3_Msk         (0x1ul << BPWM_CAPSTS_CRLIFOV3_Pos)                /*!< BPWM_T::CAPSTS: CRLIFOV3 Mask              */

#define BPWM_CAPSTS_CRLIFOV4_Pos         (4)                                                /*!< BPWM_T::CAPSTS: CRLIFOV4 Position          */
#define BPWM_CAPSTS_CRLIFOV4_Msk         (0x1ul << BPWM_CAPSTS_CRLIFOV4_Pos)                /*!< BPWM_T::CAPSTS: CRLIFOV4 Mask              */

#define BPWM_CAPSTS_CRLIFOV5_Pos         (5)                                                /*!< BPWM_T::CAPSTS: CRLIFOV5 Position          */
#define BPWM_CAPSTS_CRLIFOV5_Msk         (0x1ul << BPWM_CAPSTS_CRLIFOV5_Pos)                /*!< BPWM_T::CAPSTS: CRLIFOV5 Mask              */

#define BPWM_CAPSTS_CFLIFOVn_Pos         (8)                                                /*!< BPWM_T::CAPSTS: CFLIFOVn Position          */
#define BPWM_CAPSTS_CFLIFOVn_Msk         (0x3ful << BPWM_CAPSTS_CFLIFOVn_Pos)               /*!< BPWM_T::CAPSTS: CFLIFOVn Mask              */

#define BPWM_CAPSTS_CFLIFOV0_Pos         (8)                                                /*!< BPWM_T::CAPSTS: CFLIFOV0 Position          */
#define BPWM_CAPSTS_CFLIFOV0_Msk         (0x1ul << BPWM_CAPSTS_CFLIFOV0_Pos)                /*!< BPWM_T::CAPSTS: CFLIFOV0 Mask              */

#define BPWM_CAPSTS_CFLIFOV1_Pos         (9)                                                /*!< BPWM_T::CAPSTS: CFLIFOV1 Position          */
#define BPWM_CAPSTS_CFLIFOV1_Msk         (0x1ul << BPWM_CAPSTS_CFLIFOV1_Pos)                /*!< BPWM_T::CAPSTS: CFLIFOV1 Mask              */

#define BPWM_CAPSTS_CFLIFOV2_Pos         (10)                                               /*!< BPWM_T::CAPSTS: CFLIFOV2 Position          */
#define BPWM_CAPSTS_CFLIFOV2_Msk         (0x1ul << BPWM_CAPSTS_CFLIFOV2_Pos)                /*!< BPWM_T::CAPSTS: CFLIFOV2 Mask              */

#define BPWM_CAPSTS_CFLIFOV3_Pos         (11)                                               /*!< BPWM_T::CAPSTS: CFLIFOV3 Position          */
#define BPWM_CAPSTS_CFLIFOV3_Msk         (0x1ul << BPWM_CAPSTS_CFLIFOV3_Pos)                /*!< BPWM_T::CAPSTS: CFLIFOV3 Mask              */

#define BPWM_CAPSTS_CFLIFOV4_Pos         (12)                                               /*!< BPWM_T::CAPSTS: CFLIFOV4 Position          */
#define BPWM_CAPSTS_CFLIFOV4_Msk         (0x1ul << BPWM_CAPSTS_CFLIFOV4_Pos)                /*!< BPWM_T::CAPSTS: CFLIFOV4 Mask              */

